[
  {
    "id": 1,
    "title": "Tickncook",
    "description": "Application complémentaire permettant aux restaurateurs de saisir manuellement leurs commandes lorsque leurs caisses ne sont pas compatibles avec TicknCook.",
    "description-plus": "Développement d'une application web complémentaire qui permet aux restaurateurs dont les caisses enregistreuses ne sont pas compatibles avec TicknCook de continuer à utiliser le système. Cette side app reproduit les fonctionnalités essentielles de l'application principale et assure la transmission des commandes au système TicknCook malgré l'absence d'intégration native.",
    "problématique": null,
    "technologies": ["Angular", "Node.js", "Express", "PWA"],
    "image": "/tnk/1.png",
    "image__file": "/tnk",
    "github": null,
    "demo": null,
    "link": "https://tickncook.com/fr/",
    "type": "pro",
    "is_abort": null
  },
  {
    "id": 2,
    "title": "Dashboard Analytics DeFi",
    "description": "Tableau de bord interactif pour analyser des stratégies de trading sur les tokens Pendle Finance et identifier des opportunités d'arbitrage.",
    "description-plus": "Une application web complète développée pour analyser et simuler des stratégies de trading sur les tokens Pendle Finance (PT - Principal Token et YT - Yield Token). La plateforme permet aux traders DeFi d'identifier des opportunités d'arbitrage, de visualiser les données de marché en temps réel et de backtester des stratégies sans risque financier.",
    "problématique": "Les traders DeFi manquent d'outils spécialisés pour analyser les opportunités d'arbitrage entre le Base APY (rendement sous-jacent) et l'Implied APY (rendement implicite) des tokens Pendle. Cette plateforme comble ce manque en fournissant une interface complète d'analyse, de simulation et de backtesting. Cependant, le projet a été arrêté pour plusieurs raisons : le public cible est très restreint (niche DeFi), le potentiel de rendement n'était pas suffisant pour justifier le développement continu, et des limites techniques importantes (slippage, frais de transaction élevés, complexité des mécanismes de marché) rendaient difficile la création d'un produit viable et rentable.",
    "technologies": ["React", "Python (Flask)", "SQLite", "Lightweight Charts"],
    "image": "/defi/1.png",
    "image__file": "/defi",
    "github": "https://github.com/Vaubon-ent/TradingView",
    "demo": null,
    "link": null,
    "type": "perso",
    "is_abort": true
  },
  {
    "id": 3,
    "title": "Model MLP on MNIST",
    "description": "Réseau de neurones pour la reconnaissance de chiffres manuscrits (MNIST), inspiré de 3Blue1Brown. Implémentation from scratch avec PyTorch, support multi-GPU et interface graphique PyQt5 pour dessiner et tester.",
    "description-plus": "Réseau de neurones pour la reconnaissance de chiffres manuscrits (MNIST), inspiré des vidéos de 3Blue1Brown. Implémentation from scratch avec PyTorch, sans frameworks de haut niveau.\n\n**Fonctionnalités principales :**\n- Architecture multi-couches (784 → 256 → 128 → 10) avec ReLU et softmax\n- Entraînement avec rétropropagation et descente de gradient\n- Support multi-GPU (2 GPU AMD Vega 64) via threading pour paralléliser les batches\n- Interface graphique PyQt5 pour dessiner des chiffres et obtenir des prédictions en temps réel\n- Gestion du dataset MNIST (60 000 images d'entraînement, 10 000 de test)\n- Sauvegarde et chargement de modèles avec métadonnées (précision, temps d'entraînement, etc.)\n- Optimisations : learning rate adaptatif, batch processing, gestion mémoire GPU/CPU\n\n**Performance :** Le modèle atteint environ 90% de précision après 100 epochs avec l'architecture optimisée.",
    "problématique": null,
    "technologies": ["Python", "Pythorch", "Rocm", "PyQt5"],
    "image__file": null,
    "github": "https://github.com/Vaubon-ent/local-llm",
    "demo": null,
    "link": null,
    "type": "perso",
    "is_abort": false
  }
]

